// ייבוא היכולות של jQuery על-מנת שהאובייקט AlbumsBoard יוכל להשתמש בהן
import $ from 'jquery'
// ייבוא היכולות של האובייקט AlbumAPIService על-מנת שהאובייקט AlbumsBoard יוכל להשתמש בהן
import AlbumAPIService from './../APIServices/AlbumAPIService'
// ייבוא היכולות של האובייקט AlbumTemplates על-מנת שהאובייקט AlbumsBoard יוכל להשתמש בהן
import AlbumTemplates from '../Templates/AlbumTemplates'

// האובייקט AlbumsBoard מכיל את כל הפונקציות שבאמצעותן מתאפשר לתקשר אל מול לוח האלבומים
// הגדרה של האובייקט AlbumsBoard כקבוע
const AlbumsBoard = {
    // באמצעות הפונקציה getAllAlbums מתאפשר לקבל את כל האלבומים השמורים במסד הנתונים
    getAllAlbums: function () {
        // הפונקציה מחזירה את הפונקציה getAllAlbums המצויה תחת האובייקט AlbumAPIService ושבאמצעותה מתאפשר לקבל את כל האלבומים השמורים במסד הנתונים
        return AlbumAPIService.getAllAlbums()
    },

    // באמצעות הפונקציה appendAlbums (שמקבלת את המשתנה albums המכיל את כל הפרטים של האלבומים) מתאפשר להכניס אלבומים ל- DOM
    appendAlbums: function ( albums ) {
        // המשתנה html מפעיל את הפונקציה appendAlbums (שמקבלת את המשתנה albums המכיל את כל הפרטים של האלבומים) המצויה תחת האובייקט AlbumTemplates ושבאמצעותה מתאפשר להכניס ל- DOM את התבנית html של האלבומים
        let html = AlbumTemplates.appendAlbums( albums )

        // הפעלה של הפונקציה fadeTo שבאמצעותה מתאפשר לבצע שינוי בהדרגה של אטימות האלמנט div שיש לו מזהה ייחודי בשם album-list ושפונקציית ה- callback שלה (המסומנת כפונקציית חץ) מבצעת מספר פעולות
        $('#album-list').fadeTo('slow', 1.5, () => {
            // הסרה של ה- class בשם loading מהאלמנט div שיש לו מזהה ייחודי album-list
            $('#album-list').removeClass('loading')
        // הפעלה של הפונקציה delay שבאמצעותה מתאפשר לבצע השהייה של האלמנט למשך שנייה וחצי ושפונקציית ה- callback שלה (המסומנת כפונקציית חץ) מבצעת מספר פעולות
        }).delay(1500, () => {
            // הכנסה של המשתנה html לתוך אלמנט div שיש לו מזהה ייחודי בשם album-list, ובכך מתאפשר להציג למשתמש ב- DOM את כל האלבומים השמורים במסד הנתונים לאחר שה- loader הוסר מה- DOM
            $('#album-list').html( html )
        })
    },

    // באמצעות הפונקציה noAlbums מתאפשר להציג הודעה מתאימה ב- DOM כאשר אין אלבומים שמורים במסד הנתונים
    noAlbums: function () {
        // המשתנה html מפעיל את הפונקציה noAlbums המצויה תחת האובייקט AlbumTemplates ושבאמצעותה מתאפשר ליצור תבנית html המציגה ב- DOM הודעה האומרת שאין אלבומים ולהוספת אלבום חדש יש ללחוץ על הכפתור המתאים כאשר אין אלבומים שמורים במסד הנתונים
        let html = AlbumTemplates.noAlbums()

        // הפעלה של הפונקציה fadeTo שבאמצעותה מתאפשר לבצע שינוי בהדרגה של אטימות האלמנט div שיש לו מזהה ייחודי בשם album-list ושפונקציית ה- callback שלה (המסומנת כפונקציית חץ) מבצעת מספר פעולות
        $('#album-list').fadeTo('slow', 1.5, () => {
            // הסרה של ה- class בשם loading מהאלמנט div שיש לו מזהה ייחודי album-list
            $('#album-list').removeClass('loading')
        // הפעלה של הפונקציה delay שבאמצעותה מתאפשר לבצע השהייה של האלמנט למשך שנייה וחצי ושפונקציית ה- callback שלה (המסומנת כפונקציית חץ) מבצעת מספר פעולות
        }).delay(1500, () => {
            // הכנסה של המשתנה html לתוך אלמנט div שיש לו מזהה ייחודי בשם album-list, ובכך מתאפשר להציג למשתמש ב- DOM הודעה האומרת שאין אלבומים ולהוספת אלבום חדש יש ללחוץ על הכפתור המתאים כאשר אין אלבומים שמורים במסד הנתונים לאחר שה- loader הוסר מה- DOM
            $('#album-list').html( html )
        })
    },

    // באמצעות הפונקציה applyAlbums מתאפשר להביא את כל האלבומים השמורים במסד הנתונים ולהציגם ב- DOM
    applyAlbums: function () {
        // הפעלה של הפונקציה getAllAlbums שבאמצעותה מתאפשר לקבל את כל האלבומים השמורים במסד הנתונים, ולאחר מכן נפעיל promise שפונקציית ה- callback שלו (המסומנת כפונקציית חץ) מקבלת את המשתנה albums המכיל את כל הפרטים של האלבומים, את המשתנה status המכיל את הודעת הסטטוס שקיבלנו ואת המשתנה xhr המכיל אובייקט המבצע אינטרקציה עם השרת ושבאמצעותו מתאפשר לאחזר נתונים מכתובת האתר מבלי לבצע רענון מלא של העמוד ולהפריע לפעולות המשתמש ובכך לעדכן רק את החלק הרלוונטי בעמוד ומבצעת מספר פעולות
        this.getAllAlbums().then(( albums, status, xhr ) => {
            // נבדוק אם המשתנה albums הוא undefined או אם הפרופרטי status המצוי במשתנה xhr מכיל את הודעת השגיאה עם הסטטוס קוד 204 (No Content) האומרת שמסד הנתונים עיבד בהצלחה את הבקשה, אך אינו מחזיר תוכן, מאחר ואין אלבומים שמורים במסד הנתונים, אז נבצע מספר פעולות
            if ( typeof albums === 'undefined' || xhr.status === 204 )
                // הפעלה של הפונקציה noAlbums שבאמצעותה מתאפשר להציג הודעה מתאימה ב- DOM כאשר אין אלבומים שמורים במסד הנתונים
                this.noAlbums()
            // אחרת, כלומר יש אלבומים שמורים במסד הנתונים, אז נבצע מספר פעולות
            else
                // הפעלה של הפונקציה appendAlbums (שמקבלת את המשתנה albums המכיל את כל הפרטים של האלבומים) שבאמצעותה מתאפשר להכניס אלבומים ל- DOM
                this.appendAlbums( albums )
        })
    },

    // הפונקציה init מכילה את כל הפעולות שאנו מעוניינים שיבוצעו עם הפעלתו של האובייקט AlbumsBoard
    init: function () {
        // הפעלה של הפונקציה applyAlbums שבאמצעותה מתאפשר להביא את כל האלבומים השמורים במסד הנתונים ולהציגם ב- DOM
        this.applyAlbums()
    }
}

// ייצוא היכולות של האובייקט AlbumsBoard החוצה
export default AlbumsBoard