// ייבוא היכולות של jQuery על-מנת שהאובייקט App יוכל להשתמש בהן
import $ from 'jquery'
// ייבוא היכולות של ה- class AlbumForm על-מנת שהאובייקט App יוכל להשתמש בהן
import AlbumForm from './AlbumForm'
// ייבוא היכולות של האובייקט AlbumPlayer על-מנת שהאובייקט App יוכל להשתמש בהן
import AlbumPlayer from './AlbumPlayer'
// ייבוא היכולות של ה- class AlbumsBoard על-מנת שהאובייקט App יוכל להשתמש בהן
import AlbumsBoard from './AlbumsBoard'
// ייבוא היכולות של האובייקט Player על-מנת שהאובייקט App יוכל להשתמש בהן
import Player from './Player'
// ייבוא היכולות של האובייקט Router על-מנת שהאובייקט App יוכל להשתמש בהן
import Router from './Router'
// ייבוא היכולות של ה- class Search על-מנת שהאובייקט App יוכל להשתמש בהן
import Search from './Search'

// האובייקט App המתפקד כ"מעין" מחלקת שירות מכיל את כל היכולות של האפליקציה
// הגדרת האובייקט App כקבוע
const App = {
    // הפונקציה init מכילה את כל הפעולות שאנו מעוניינים שיבוצעו עם הפעלתו של האובייקט
    init: function() {
        // הפעלה של הפונקציה init המצויה תחת האובייקט Router המכילה את כל הפעולות שאנו מעוניינים שיבוצעו עם הפעלתו של האובייקט, ולאחר מכן תתבצע הפעלה של פונקציית callback (המסומנת כפונקציית חץ), המפעילה את כל הנתונים הנמצאים בתוכה
        Router.init(() => {
            // הפעלה של הפונקציה init המצויה תחת האובייקט AlbumPlayer המכילה את כל הפעולות שאנו מעוניינים שיבוצעו עם הפעלתו של האובייקט
            AlbumPlayer.init()
            // יצירת אינסטנס חדש של ה- class AlbumForm המכיל את כל הפונקציות המאפשרות לנו לתקשר אל מול הטופס הוספת אלבום חדש
            new AlbumForm()
            // יצירת אינסטנס חדש של ה- class AlbumsBoard המכיל את כל הפונקציות המאפשרות לנו לתקשר אל מול הלוח של האלבומים
            new AlbumsBoard()
            // יצירת אינסטנס חדש של ה- class Search המכיל את כל הפונקציות המאפשרות לנו לבצע את הפעולה של חיפוש הנתונים
            new Search()
            // הפעלה של הפונקציה init המצויה תחת האובייקט Player המכילה את כל הפעולות שאנו מעוניינים שיבוצעו עם הפעלתו של האובייקט
            Player.init()
        })
    }
}

// הגדרה של כל הנתונים שאנו מעוניינים שיעלו עם העלאת הדף והפעלת הפונקציה init המצויה תחת האובייקט App המכילה את כל הפעולות שאנו מעוניינים שיבוצעו עם הפעלתו של האובייקט
$( document ).ready( App.init )